public class lesson_13_12 {
    //Создание объекта ArrayList
    //Чтобы создать объект класса ArrayList, нужно написать код типа:
    //ArrayList<Тип> имя = new ArrayList<Тип>();

    //Где ArrayList — это тип/класс коллекции, Тип — это тип элементов,
    //которые хранит коллекция ArrayList, а имя — это имя переменной типа ArrayList<Тип>.
    //Тип у переменной имя составной — состоит аж из двух типов: сначала указывается тип коллекции,
    //а в треугольных скобках указывается тип элементов, которые эта коллекция хранит.

    //Код	                                                    Описание
    //ArrayList<Integer> list = new ArrayList<Integer>();       Список целых чисел
    //ArrayList<String> list = new ArrayList<String>();         Список строк
    //ArrayList<Double> list = new ArrayList<Double>();         Список вещественных чисел

    //Коллекции, в отличие от массивов, не могут хранить примитивные типы: только типы-классы.
    //Поэтому если вам нужна коллекция с типом int, используйте вместо него тип-обертку — Integer.


}
